Tekla Open API Reference for Tekla Structures 2025
ViewVisibilitySettings.SurfaceTreatmentsVisible Property
 Gets or sets the surface treatment visibility.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SurfaceTreatmentsVisible { get; set; }
Public Property SurfaceTreatmentsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewVisibilitySettings Class
Tekla.Structures.Model.UI Namespace